In [1]:
import pandas as pd
import numpy as np

In [2]:
a = ['Ali', 'Alireza', 'Maral', 'Mohsen', 'Amin']

In [3]:
b = [32, 32, 30, 35, 35]

In [4]:
c = pd.DataFrame(a, b).reset_index()

In [5]:
c.columns=['age', 'name']

In [6]:
#d = ['Bachelor', 'Bachelor', 'Bachelor', 'PhD', 'Masters']

In [7]:
#c = pd.DataFrame(c, d)
c

   age     name
0   32      Ali
1   32  Alireza
2   30    Maral
3   35   Mohsen
4   35     Amin

In [8]:
c = pd.concat([c, pd.get_dummies(c.age)], axis=1)

In [9]:
c

   age     name  30  32  35
0   32      Ali   0   1   0
1   32  Alireza   0   1   0
2   30    Maral   1   0   0
3   35   Mohsen   0   0   1
4   35     Amin   0   0   1